Revit 2027 API
ParameterTypeId.LineStyle Property
 "Line Style:"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LineStyle { get; }
Public Shared ReadOnly Property LineStyle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LineStyle {
	ForgeTypeId^ get ();
}
static member LineStyle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace